Sway-Light/sway-light-ht32f52352/main.c
	BFTM0_Configuration();
	
	ledInit();
	wsInit();
	wsBlinkAll(10);
	
	GPTM1_Configuration();
	TM_Configuration();
	I2C_Configuration();
	ADC_Configuration();
	
	initFlag = TRUE;
	ADC_Cmd(HT_ADC0, ENABLE);
	TM_Cmd(HT_GPTM0, ENABLE);
	TM_Cmd(HT_GPTM1, ENABLE);
	
	/* Analog Signal Setup */
	analogSwitcherSetup();
	asSetEnable(TRUE);
	asSetSignal(1);
	
	speakerEnable(TRUE);
	
	/* ESP8266 Setup */
	espUART_Configuration();
	DataToESP(0x01, 1); 		// Sending Power-On Message
	while(toEspFlag == TRUE);	// Wait Until Data Transferred Complete
	DataToESP(0x01, mode); 		// Sending Status Message
	while(toEspFlag == TRUE);	// Wait Until Data Transferred Complete
	DataToESP(0x02, 0x01); 		// Sending Initial Values of Brightness and Color in Lighting Mode
	while(toEspFlag == TRUE);	// Wait Until Data Transferred Complete
	DataToESP(0x02, 0x03); 		// Sending Initial Values of Scale in Lighting Mode
	
	/* MP3 UART Setup */
	mp3UART_Configuration();
	mp3ResetModule(mp3CmdQueue, &queueSize);
	mp3SetDevice(mp3CmdQueue, &queueSize, 1); // SD Card
	delay(100000);
	mp3SetVolume(mp3CmdQueue, &queueSize, 20);
	mp3Play(mp3CmdQueue, &queueSize, 1);
	delay(100000);
	
	asSetSignal(0);
	
	while (1) {
		if (realTime_flag == TRUE && Timestamp != 0) {
			char buf[80];
			Timestamp += 1;
			
			ts = *localtime(&Timestamp);
			
			strftime(buf, sizeof(buf), "%a %Y-%m-%d %H:%M:%S %Z", &ts);
			printf("\r%s", buf);
			
			if (weekdayEN[ts.tm_wday - 1] == 1) {
				if (auto_OnOff[1] == 1 && mode != 0) {
					if (AutoOff.tm_hour == ts.tm_hour && AutoOff.tm_min == ts.tm_min && AutoOff.tm_sec == ts.tm_sec) {
						auto_OnOff[1] = 0;
						mode = 0;
						wsBlinkAll(10);
						wsShow();
						speakerEnable(FALSE);
					}
				} else if (auto_OnOff[0] == 1 && mode == 0) {
					if (AutoOn.tm_hour == ts.tm_hour && AutoOn.tm_min == ts.tm_min && AutoOn.tm_sec == ts.tm_sec) {
						auto_OnOff[0] = 0;
						mode = 3;
						wsBlinkAll(10);
						wsShow();
						adcIndex = 0;
						speakerEnable(TRUE);
					}
				}
			}
			
			realTime_flag = FALSE;
		}
		if (espFlag) {
			u8 i;
			u16 sum = 0, checksum = 0;
			u32 time = 0;
			
			for (i = 1; i < 7; i++) sum += data_from_esp[i];
			checksum = (data_from_esp[7] << 8) + data_from_esp[8];

			printf("\r\n");
			if (!(data_from_esp[0] == 0x95)) {
				printf("start byte Error\r\n");
				errorFlag = TRUE;
			}
			if (checksum == sum) {
				
				DataFromESP(data_from_esp);
				
				for (i = 0; i < 9; i++) {
					printf("0x%02X ", data_from_esp[i]);
				}
				printf("checksum Correct!\r\n");
				
			} else {
				printf("checksum Error!\r\n");
//				printf("checksum = %04X\r\n", checksum);
//				printf("sum = %04X\r\n", sum);
				
			}
			espFlag = FALSE;
		}
		if (mBtAction == btClick) {
			static bool flag = TRUE;
			mBtAction = btNone;
			printf("click\r\n");
			
			if (mode == 2) mode = 3;
			else if (mode == 3) {
				mode = 2;
				adcIndex = 0;
			}
			if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
			
			wsUpdateMag();
		} else if (mBtAction == btLongClick) {
			mBtAction = btNone;
			printf("long click\r\n");
			
			if (mode != 0) {
				
				asSetSignal(1);
				mp3SetVolume(mp3CmdQueue, &queueSize, 20);
				mp3Play(mp3CmdQueue, &queueSize, 2);
				delay(10000);
				
				mode = 0;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-Off Message
				
				wsBlinkAll(10);
				wsShow();
				speakerEnable(FALSE);
				
				printf("off\r\n");
			} else {
				mode = 1;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-On Message
				delay(1000);
				mode = 3;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
				
				adcIndex = 0;
				
				speakerEnable(TRUE);
				asSetSignal(1);
				mp3SetVolume(mp3CmdQueue, &queueSize, 20);
				mp3Play(mp3CmdQueue, &queueSize, 1);
				delay(10000);
				asSetSignal(0);
				
				printf("on\r\n");
			}
		}
		
		if (touchKeyDelayFlag) {
			if (!GPIO_ReadInBit(HT_GPIOC, GPIO_PIN_0)) {
				TK_CHECK = TRUE;
				Touch.Data = Touchkey_ButtonRead();
				get_TKLR();
//				printf("\rStatus = %d, DATA = %04X, slideValue = %3d, zoomValue = %3d", status, Touch.Data, slideValue, zoomValue);
				if (status == slide) {
					Slide(TK_L, TK_R, &slideValue);
					if (toEspFlag != TRUE) DataToESP(0x02, 0x01); // Sending Brightness in Lighting Mode
				} else if (status == zoom) {
					Zoom(TK_L, TK_R, &zoomValue);
					if (toEspFlag != TRUE) DataToESP(0x02, 0x03); // Sending Scale in Lighting Mode
				}
				
				wsUpdateMag();
				touchKeyDelayFlag = FALSE;
			} else {
				TK_CHECK = FALSE;
				TK_1SEC = TRUE;
				TK_COUNT = 0;
				status = none;
			}
		}
		
		if (mode == 3) {
			ADC_MainRoutine();
			if (sampleFlag) {
				for (j = 0; j < TEST_LENGTH_SAMPLES; j += 1) fftData[j] = ((float)InputSignal[j]) / 2048.0;
				RUN_FFT();
				wsUpdateMag();
			}
		}
	}
}

/* Setup functions -----------------------------------------------------------------------------------------*/
void NVIC_Configuration(void) {
	/* Set the Vector Table base location at 0x00000000   */
	NVIC_SetVectorTable(NVIC_VECTTABLE_FLASH, 0x0);
}

void CKCU_Configuration(void) {
	#if 1
	CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
	CKCUClock.Bit.AFIO = 1;
	CKCU_PeripClockConfig(CKCUClock, ENABLE);
	#endif

	#if (ENABLE_CKOUT == 1)
	CKOUTConfig();
	#endif
}

void GPIO_Configuration(void) {
	{ /* Enable peripheral clock                                                                              */
		CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
		CKCUClock.Bit.PA = 1;
		CKCUClock.Bit.PB = 1;
		CKCUClock.Bit.PC = 1;
		CKCUClock.Bit.PD = 1;
		CKCU_PeripClockConfig(CKCUClock, ENABLE);
	}
	
	GPIO_DirectionConfig(HT_GPIOC, GPIO_PIN_0, GPIO_DIR_IN);
	GPIO_InputConfig(HT_GPIOC, GPIO_PIN_0, ENABLE);
	
	GPIO_DirectionConfig(HT_GPIOB, GPIO_PIN_1, GPIO_DIR_IN);
	GPIO_InputConfig(HT_GPIOB, GPIO_PIN_1, ENABLE);
	
	// Music mute pin
	GPIO_DirectionConfig(HT_GPIOC, GPIO_PIN_15, GPIO_DIR_OUT);
	
#if (RETARGET_PORT == RETARGET_USART0)
	AFIO_GPxConfig(GPIO_PA, AFIO_PIN_2 | AFIO_PIN_3, AFIO_FUN_USART_UART);
#endif

#if (RETARGET_PORT == RETARGET_USART1)
	AFIO_GPxConfig(GPIO_PA, AFIO_PIN_4 | AFIO_PIN_5, AFIO_FUN_USART_UART);
#endif

#if (RETARGET_PORT == RETARGET_UART0)
	AFIO_GPxConfig(GPIO_PC, AFIO_PIN_4 | AFIO_PIN_5, AFIO_FUN_USART_UART);
#endif

