Sway-Light/sway-light-ht32f52352/main.c
void wsUpdateMag() {
	u8 i, j;
	
	if (mode == 2) {
		// Light Source Mode
		u8 rows[16] = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0};
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			if (zoomValue <= 2) {
				if (i >= 7 && i <= 8) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 4) {
				if (i >= 6 && i <= 9) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 6) {
				if (i >= 5 && i <= 10) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 8) {
				if (i >= 4 && i <= 11) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 10) {
				if (i >= 3 && i <= 12) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 12) {
				if (i >= 2 && i <= 13) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 14) {
				if (i >= 1 && i <= 14) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 16) {
				rows[i] = 1;
			}
		}
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			for (j = 0; j < WS_LEV_SIZE; j += 1) {
				if (rows[i] == 1) wsSetColor(WS_LED[i][j], Color, slideValue);
				else wsSetColor(WS_LED[i][j], ws_clean, 0);
			}
		}
	} else if (mode == 3) {
		// Music Mode
		u8 level;
		
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			u8 scale = 2;
			if (OutputSignal[i*scale + 1] < 3) level = 1;
			else if(OutputSignal[i*scale + 1] < 5) level = 2;
			else if(OutputSignal[i*scale + 1] < 8) level = 3;
			else if(OutputSignal[i*scale + 1] < 11) level = 4;
			else if(OutputSignal[i*scale + 1] < 14) level = 5;
			else if(OutputSignal[i*scale + 1] < 17) level = 6;
			else if(OutputSignal[i*scale + 1] < 20) level = 7;
			else if(OutputSignal[i*scale + 1] < 23) level = 8;
			else if(OutputSignal[i*scale + 1] < 26) level = 9;
			else level = 10;
			
			for (j = 0; j < WS_LEV_SIZE; j += 1) {
				//WS_LED[index][level]
//				if (j < level) wsSetColor(WS_LED[i][j], musicColor[j], ((float)slideValue) / 100.0);
				if (j < level) wsSetColor(WS_LED[i][j], musicColor[j], 30);
				else wsSetColor(WS_LED[i][j], musicColor[j], 0);
				if(j == wsLevel[i] - 1)
//					wsSetColor(WS_LED[i][j], musicColor[j], ((float)slideValue) / 100.0);
					wsSetColor(WS_LED[i][j], musicColor[j], 30);
			}
			
			if(level > wsLevel[i]) {
				wsLevel[i] = level;
				wsLevelTM[i] = 50;
			}
			if(wsLevelTM[i] == 0) {
				if(wsLevel[i] >= level) wsLevel[i]--;
				wsLevelTM[i] = 8;
			}
		}
	}
	
	startShow = TRUE;
}

void ADC_MainRoutine(void) {
	if (gADC_CycleEndOfConversion) {
		if (adcIndex < TEST_LENGTH_SAMPLES) {
			InputSignal[adcIndex] = gADC_Result;
			InputSignal[adcIndex + 1] = 0;
			adcIndex += 2;
		} else {
			sampleFlag = TRUE;
		}
		gADC_CycleEndOfConversion = FALSE;
	}
}

void RUN_FFT(void) {
	/* Process the data through the CFFT/CIFFT module */
	arm_cfft_f32(&arm_cfft_sR_f32_len64, fftData, ifftFlag, doBitReverse);

	/* Process the data through the Complex Magnitude Module for
	calculating the magnitude at each bin */
	arm_cmplx_mag_f32(fftData, OutputSignal, fftSize);
}

void speakerEnable(bool enable) {
	// Music mute pin
	// Enable  -> low
	// Disable -> high
	GPIO_WriteOutBits(HT_GPIOC, GPIO_PIN_15, (FlagStatus)!enable);
}

void calculateGradient(u8 i1, u8 i2, u8 Fst_color[], u8 Snd_color[]) {
	u8 color_level, color_rgb, value = 0;
	
	for (color_level = i1; color_level <= i2; color_level++) {
		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
			
			if (Snd_color[color_rgb] > Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * color_level;
			} else if (Snd_color[color_rgb] < Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * color_level;
			} else {
				value = Fst_color[color_rgb];
			}
			
			musicColor[color_level][color_rgb] = value;
		}
	}
}

void generateMusicColor(u8 level) {
	u8 color_level, color_rgb;
	
	for (color_rgb = 0; color_rgb < 3; color_rgb++) {
		if (level == 0x03) {
			musicColor[0][color_rgb] = low_color[color_rgb];
		} else if (level == 0x02) {
			musicColor[4][color_rgb] = mid_color[color_rgb];
			musicColor[5][color_rgb] = mid_color[color_rgb];
		} else if (level == 0x01) {
			musicColor[9][color_rgb] = high_color[color_rgb];
		}
	}
	
	if (level == 0x03 || level == 0x02) calculateGradient(1, 3, low_color, mid_color);
	if (level == 0x01 || level == 0x02) calculateGradient(6, 8, mid_color, high_color);
	
//	for (color_level = 0; color_level < WS_LEV_SIZE; color_level++) {
//		printf("musicColor[%2d]: ", color_level);
//		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
//			printf("%3d ", musicColor[color_level][color_rgb]);
//		}
//		printf("\r\n");
//	}
}

void DataToESP(u8 category, u8 type) {
	u8 i;
	u16 checksum = 0;
	
	data_to_esp[0] = 0x95; // Start Bit
	data_to_esp[1] = category;
	data_to_esp[2] = type;
	if (category == 0x01) {
		for (i = 3; i <= 6; i++) data_to_esp[i] = 0x00;
	} else if (category == 0x02) {
		if (type == 0x01) {
			data_to_esp[3] = slideValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = Color[i - 4];
		} else if (type == 0x03) {
			data_to_esp[3] = zoomValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = 0x00;
		}
	}
	for (i = 1; i <= 6; i++) checksum += data_to_esp[i];
	data_to_esp[7] = checksum >> 8;
	data_to_esp[8] = checksum & 0x00FF;
	data_to_esp[9] = 0x87; // End Bit
	
	printf("Sending: [");
	for (i = 0; i < 10; i++) printf("%02X ", data_to_esp[i]);
	printf("]\r\n");
	
	send_index = 0;
	toEspFlag = TRUE;
	USART_IntConfig(HT_USART0, USART_INT_TXDE, ENABLE);
}

void DataFromESP(u8 command[]) {
	u8 i, data[4];
	
	for (i = 0; i <= 3; i++) data[i] = command[i + 3];
	
	if (command[1] == 0x01) {			// Switching Mode
		printf("Switching Mode: \r\n");
		SwitchingMode(command[2]);
	} else if (command[1] == 0x02) {	// Lighting Mode
		printf("Lighting Mode: \r\n");
		LightingMode(command[2], data);
	} else if (command[1] == 0x03) {	// Music Mode
		printf("Music Mode: \r\n");
		MusicMode(command[2], data);
	} else if (command[1] == 0x04) {	// Setting
		printf("Setting: \r\n");
		Setting(command[2], data);
	}
}

void SwitchingMode(u8 status) {
	mode = status;
	
	if (mode == 0) {
//		asSetSignal(1);
//		mp3SetVolume(mp3CmdQueue, &queueSize, 20);
//		mp3Play(mp3CmdQueue, &queueSize, 2);
//		delay(10000);
//		asSetSignal(0);
		
